app/controllers/resources_controller.rb

  def index
    @stocks = Stock.where(user_id: session[:current_user_id]).order("ticker_symbol ASC")
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = $1 ORDER BY ticker_symbol ASC  [["user_id", "le2fz9xm92m3gi59"]]