app/controllers/stocks_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker_symbol" = $1 AND "stocks"."user_id" = $2 LIMIT $3  [["ticker_symbol", "TSLA"], ["user_id", "sh8ew2sa96s6wp9t"], ["LIMIT", 1]]
INSERT INTO "stocks" ("ticker_symbol", "company_name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticker_symbol", "WMT"], ["company_name", "Walmart"], ["created_at", "2017-06-19 21:35:11.485001"], ["updated_at", "2017-06-19 21:35:11.485001"], ["user_id", "le2fz9xm92m3gi59"]]
---
  def create
    @stock = Stock.new(stock_params)
    @stock.ticker_symbol = @stock.ticker_symbol.upcase

    #instantiate YahooFinance client
    yahoo_client = YahooFinance::Client.new
    #attempt to retrieve data for stock being created
    @data_create = yahoo_client.quotes([@stock.ticker_symbol], [:close])
    #"N/A" will be returned if no data can be found for ticker
    #used to check if ticker user provides is valid
    if @data_create[0].close.eql? "N/A"
      #re-render form and provides user feedback
      redirect_to new_stock_path(message: 'Cannot find the given ticker')
      return
    end

    #check to see if stock they are trying to add is already being tracked by them
    #attempt to 'find' the stock in their table of stocks
    duplicate = Stock.find_by(ticker_symbol: @stock.ticker_symbol, user_id: session[:current_user_id])
    #if the stock is found
    if !(duplicate.nil?)
      redirect_to new_stock_path(message: 'You are already tracking this stock!')
      return
    end

    #check for successful save
    if @stock.save

DELETE FROM "stocks" WHERE "stocks"."id" = $1  [["id", 2]]
---
  def destroy
    @stock.destroy